---
kind: method
id: M:Autodesk.Revit.DB.Architecture.TopographySurface.AddPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
source: html/d918a387-2f34-5ed8-6b56-b690ca756320.htm
---
# Autodesk.Revit.DB.Architecture.TopographySurface.AddPoints Method

Adds points to a topography surface.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
public void AddPoints(
	IList<XYZ> points
)
```

## Parameters
- **points** (`System.Collections.Generic.IList < XYZ >`) - A collection of points to be added.

## Remarks
If an input point already exists in the surface at the same XY location, the point will not be added.
 The document will be regenerated by this function.
 This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which should be in an active TopographyEditScope.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - There are no points in the input points set.
 -or-
 One or more points shared the same XY location (even with different elevations). This is not permitted for topography surfaces.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This element is not a TopographySurface.
 -or-
 The topography surface is not editable.
 -or-
 The points of this topography surface are not editable.
 -or-
 The TopographySurface element is not in an active TopographyEditScope.
 Modification cannot be made on this TopographySurface.
- **Autodesk.Revit.Exceptions.ModificationForbiddenException** - The document containing this TopographySurface is in failure mode: an operation has failed,
 and Revit requires the user to either cancel the operation
 or fix the problem (usually by deleting certain elements).
 -or-
 The document containing this TopographySurface is being loaded, or is in the midst of another
 sensitive process.
- **Autodesk.Revit.Exceptions.ModificationOutsideTransactionException** - The document containing this TopographySurface has no open transaction.